import { http, HttpResponse } from "msw";
import { getTopicChartPath } from "../hooks/useGetTopicGraph";
import { TopicChartProps } from "@src/types";

export const topicMockHandler = [
  http.get(getTopicChartPath({ appId: 1, sentiment: "pos", date: "2024-1" }), () => HttpResponse.json(TOPIC_DATA)),
];

const TOPIC_DATA: TopicChartProps[] = [];
// [
//   {
//     topicId: 29,
//     ranking: -1,
//     representationWord:
//       "스킬:0.8601-요용:0.8317-캐릭터:0.8215-특성:0.8146-역동:0.8064-재미:0.7950-방식:0.7875-요소:0.7799-로그인:0.7797-스타일:0.7761",
//     representationWordAsList: [
//       {
//         "스킬": "0.8601",
//       },
//       {
//         "요용": "0.8317",
//       },
//       {
//         "캐릭터": "0.8215",
//       },
//       {
//         "특성": "0.8146",
//       },
//       {
//         "역동": "0.8064",
//       },
//       {
//         "재미": "0.7950",
//       },
//       {
//         "방식": "0.7875",
//       },
//       {
//         "요소": "0.7799",
//       },
//       {
//         "로그인": "0.7797",
//       },
//       {
//         "스타일": "0.7761",
//       },
//     ],
//   },
//   {
//     topicId: 30,
//     ranking: 0,
//     representationWord:
//       "재미:1.0000-흥미:0.9009-기대:0.8215-스킬:0.8188-고급:0.8130-내맘대로:0.8033-추천:0.8007-만족:0.7991-최고:0.7968-퀄리티:0.7926",
//     representationWordAsList: [
//       {
//         재미: "1.0000",
//       },
//       {
//         흥미: "0.9009",
//       },
//       {
//         기대: "0.8215",
//       },
//       {
//         스킬: "0.8188",
//       },
//       {
//         고급: "0.8130",
//       },
//       {
//         내맘대로: "0.8033",
//       },
//       {
//         추천: "0.8007",
//       },
//       {
//         만족: "0.7991",
//       },
//       {
//         최고: "0.7968",
//       },
//       {
//         퀄리티: "0.7926",
//       },
//     ],
//   },
//   {
//     topicId: 31,
//     ranking: 1,
//     representationWord:
//       "조작:0.6414-커스텀:0.5948-회원가입:0.5821-몰입:0.5648-갤럭시:0.5622-궁수:0.5534-길드:0.5526-커마:0.5472-노가다:0.5370-퀘스트:0.5365",
//     representationWordAsList: [
//       {
//         조작: "0.6414",
//       },
//       {
//         커스텀: "0.5948",
//       },
//       {
//         회원가입: "0.5821",
//       },
//       {
//         몰입: "0.5648",
//       },
//       {
//         갤럭시: "0.5622",
//       },
//       {
//         궁수: "0.5534",
//       },
//       {
//         길드: "0.5526",
//       },
//       {
//         커마: "0.5472",
//       },
//       {
//         노가다: "0.5370",
//       },
//       {
//         퀘스트: "0.5365",
//       },
//     ],
//   },
//   {
//     topicId: 32,
//     ranking: 2,
//     representationWord:
//       "미남:0.9923-재미:0.6538-안정:0.5403-과금:0.5236-가능:0.5159-이크:0.4485-갯수:0.4093-무소:0.3925-요소:0.3657-성장:0.3531",
//     representationWordAsList: [
//       {
//         미남: "0.9923",
//       },
//       {
//         재미: "0.6538",
//       },
//       {
//         안정: "0.5403",
//       },
//       {
//         과금: "0.5236",
//       },
//       {
//         가능: "0.5159",
//       },
//       {
//         이크: "0.4485",
//       },
//       {
//         갯수: "0.4093",
//       },
//       {
//         무소: "0.3925",
//       },
//       {
//         요소: "0.3657",
//       },
//       {
//         성장: "0.3531",
//       },
//     ],
//   },
//   {
//     topicId: 33,
//     ranking: 3,
//     representationWord:
//       "중독:0.9287-발열:0.6918-박진감:0.5772-현상:0.5361-라이트:0.5158-스토브:0.5022-:0.3443-:0.3443-:0.3443-:0.3443",
//     representationWordAsList: [
//       {
//         중독: "0.9287",
//       },
//       {
//         발열: "0.6918",
//       },
//       {
//         박진감: "0.5772",
//       },
//       {
//         현상: "0.5361",
//       },
//       {
//         라이트: "0.5158",
//       },
//       {
//         스토브: "0.5022",
//       },
//       {
//         "": "0.3443",
//       },
//       {
//         "": "0.3443",
//       },
//       {
//         "": "0.3443",
//       },
//       {
//         "": "0.3443",
//       },
//     ],
//   },
// ];
